---
kind: method
id: M:Autodesk.Revit.DB.ParameterSet.ReverseIterator
source: html/8ccc9805-a4a4-f9dc-203a-fd992faab4a2.htm
---
# Autodesk.Revit.DB.ParameterSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual ParameterSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.